cases/F17c_kovasznay_floor/case/constant/transportProperties
FoamFile { version 2.0; format ascii; class dictionary; object transportProperties; }
transportModel  Newtonian;
nu              0.025;      // = 1/Re, Re = 40; must equal exact_f17.NU (checked by the launcher)
