cases/F17c_kovasznay_floor/case/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }
solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-08;
        relTol          0.01;
    }
    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          0.1;
    }
}
SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      no;
    pRefCell        0;
    pRefValue       0;
    // NO residualControl: the run goes to endTime and the grader's Class C
    // gate decides whether it plateaued.
}
relaxationFactors
{
    fields    { p 0.3; }
    equations { U 0.7; }
}
